{
  "backend/main.mo": "Motoko backend actor providing contact form submission, admin-restricted submission viewing, and user profile management with AccessControl enforcement.",
  "feature_evidence.json": "Feature evidence report describing an implemented typing animation in the Home page hero span and its associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file listing short summaries of all frontend components and pages in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables, theme layers, dark mode overrides, and base element styling.",
  "frontend/index.html": "HTML entry point defining meta tags, favicons, SEO fields, and root mounting element for the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for main pages and wraps them in the shared SiteLayout component.",
  "frontend/src/components/contact/ContactForm.tsx": "React contact form with validation, inquiry topic selection, backend submission, and success/error handling.",
  "frontend/src/components/home/HeroCarousel.tsx": "Autoplaying, draggable hero image carousel with reduced-motion support and custom slide ordering.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component showing branding, quick links, contact text, and a credits section with a heart icon.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with logo, desktop links, and mobile navigation via a sliding sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper rendering header, footer, and routed content via Outlet.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Wrapper that reveals children with a scroll-triggered animation, respecting reduced-motion settings.",
  "frontend/src/components/services/ServiceCard.tsx": "Clickable service card displaying icon, title, description, and a call-to-action hover effect.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Dialog panel showing detailed service info, features, applications, and a contact CTA.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Search and category filter bar for services using input and select controls.",
  "frontend/src/config/branding.ts": "Centralized branding config defining logo assets, metadata, and company info.",
  "frontend/src/content/services.ts": "Data definitions and list of service objects containing descriptions, features, applications, and icons.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on user identity and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Hook for submitting contact forms through the backend actor with mutation handling.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook detecting the user's reduced-motion preference via media query.",
  "frontend/src/hooks/useSeo.ts": "React hook that updates document title and various meta tags for SEO and social sharing based on provided title and description.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark theme variables, utilities, and component styles including grid patterns and slideshow elements.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query, wraps the app in Internet Identity and renders it.",
  "frontend/src/pages/AboutPage.tsx": "About page that applies SEO metadata and renders company information, expertise list, and animated reveal sections.",
  "frontend/src/pages/ContactPage.tsx": "Contact page that sets SEO metadata and displays contact details alongside a form with scroll-based animations.",
  "frontend/src/pages/HomePage.tsx": "Home page with SEO setup, animated rotating text, hero carousel, and service overview sections.",
  "frontend/src/pages/SolutionsPage.tsx": "Solutions page that sets SEO metadata, filters and displays services, and shows details for a selected service.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores the project’s current state, including metadata, architectural notes, known issues, and generated image records."
}