{
  "backend/main.mo": "Motoko actor handling contact form submissions and user profiles with access control and admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report listing branding, logo, and SEO asset verification requirements with associated components and tests.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short functional descriptions for documentation or planning.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH-themed color variables for light and dark modes along with global resets.",
  "frontend/index.html": "HTML entry point including SEO metadata and links to generated favicon and Open Graph images.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for Home, About, Solutions, and Contact pages.",
  "frontend/src/components/contact/ContactForm.tsx": "React contact form with validation, topic selection, and backend submission via a mutation hook.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branded logo, company info, quick links, and attribution using centralized branding config.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with branded logo, desktop and mobile navigation, and active route highlighting.",
  "frontend/src/components/layout/SiteLayout.tsx": "Application layout component providing header, routed content via Outlet, and footer.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Animates child content into view on scroll using IntersectionObserver, with reduced‑motion support.",
  "frontend/src/components/services/ServiceCard.tsx": "Displays a clickable service card with icon, title, description, and keyboard accessibility.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Shows a modal with detailed service info, features, applications, and a contact CTA.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Provides search and category filters for services via input and select UI controls.",
  "frontend/src/config/branding.ts": "Central config exporting logo paths, favicon assets, and company branding metadata.",
  "frontend/src/content/services.ts": "Defines the Service type and a list of service entries with descriptions, features, and categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, state management, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exposes a mutation for submitting contact forms and invalidates related queries on success.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook that tracks the prefers-reduced-motion media query and returns its current state.",
  "frontend/src/hooks/useSeo.ts": "Updates document title and SEO meta tags whenever title or description changes.",
  "frontend/src/index.css": "Defines Tailwind layers, custom light/dark OKLCH color variables, global styles, focus states, and utility classes for an industrial-themed design.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, company overview, capabilities list, and animated reveal sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements the Contact page with SEO metadata, contact information blocks, and a contact form with scroll-based animations.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage featuring a hero section, services overview, CTAs, and animated service cards using SEO and UI components.",
  "frontend/src/pages/SolutionsPage.tsx": "Displays a filterable list of automation services with search, category filtering, and a detail panel driven by local state.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters with sessionStorage support and hash-routing compatibility.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color variables, extended theme settings, animations, and plugin integration for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a full‑stack IC app scaffold, its features, image requirements, generated assets, known issues, and architectural notes for build/deploy planning."
}