{
  "backend/main.mo": "Initializes access control state and includes authorization mixin, exposing no additional functionality.",
  "backend/migration.mo": "Defines old/new actor data types and provides a no-op migration function returning an empty state.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains textual summaries for all frontend files after the static-site conversion and UI updates.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens, light/dark theme variables, and base element styling.",
  "frontend/index.html": "Static HTML entry point setting SEO metadata and loading the static React app via main.static.tsx.",
  "frontend/public/_redirects": "Netlify SPA redirect rule routing all paths to index.html with status 200.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for Home, About, Solutions, and Contact using a shared layout.",
  "frontend/src/components/contact/ContactForm.tsx": "Frontend-only contact form with client-side validation, simulated submission delay, and success/error UI messaging.",
  "frontend/src/components/home/HeroCarousel.tsx": "Autoplaying, draggable hero image carousel with reduced-motion support and updated slide set.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with company branding, navigation links, and a copyright notice. Includes a styled layout and external link attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides a responsive site header with branding, desktop navigation, and a mobile slide-out menu. Highlights active routes using router state.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps all pages with a shared header, footer, and main content outlet. Defines the overall page structure.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Animates child content into view when scrolled into the viewport using IntersectionObserver. Supports reduced-motion preferences and optional delay.",
  "frontend/src/components/services/ServiceCard.tsx": "Displays a clickable service card with icon, title, description, and a hover animation. Supports keyboard interaction via Enter/Space.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Shows a modal with detailed service information including features, applications, and contact CTA. Closes via dialog state passed from parent.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Provides search input and category dropdown for filtering services. Uses UI components and controlled input state.",
  "frontend/src/config/branding.ts": "Centralized branding config defining logos, meta-image paths, and company information. Used across layout and SEO components.",
  "frontend/src/content/services.ts": "Defines the Service interface and a list of service objects with descriptions, features, applications, categories, and icons. Serves as static content for service-related components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity authentication using React Query. Recreates and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Dfinity AuthClient, exposing identity, login, logout, and login state. Loads stored identities and manages login flow.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file kept for compatibility after removal of backend queries.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook that tracks the user's prefers-reduced-motion setting via a media query.",
  "frontend/src/hooks/useSeo.ts": "Hook that updates document title and various meta tags for SEO and social sharing.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, color variables, dark mode, utilities, and component styles including slideshow classes.",
  "frontend/src/main.static.tsx": "Static build entry using React Query and rendering the App component with default query options.",
  "frontend/src/main.tsx": "Main entry point that wraps the App with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/AboutPage.tsx": "About page with company overview, capabilities list, and SEO metadata setup.",
  "frontend/src/pages/ContactPage.tsx": "Contact page providing contact details, a form, and SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring hero section with typing animation, services overview, carousel, and SEO metadata.",
  "frontend/src/pages/SolutionsPage.tsx": "Solutions page offering searchable and filterable service listings with detail panels and SEO metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings using plugins and CSS variables.",
  "project_state.json": "Tracks the project’s current state, requirements, known issues, and image updates for converting the ICP app into a static React/Vite site."
}