{
  "backend/main.mo": "Motoko actor managing user profiles with access‑controlled get and save operations using AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report describing the Industry 4.0 solution card addition and listing related files, components, and metadata.",
  "frontend-file-summaries.txt": "JSON-like text file providing one‑sentence summaries for major frontend source files and components.",
  "frontend/docs/FILE_TREE.md": "Markdown document outlining the project's regenerated file structure.",
  "frontend/docs/screenshot-assets-audit.md": "Documentation explaining the screenshot asset audit tool and how it identifies referenced vs unreferenced images.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry file setting metadata, icons, and loading the main React script.",
  "frontend/public/_redirects": "Netlify-style redirects defining .well-known handling, ic-assets.json passthrough, and SPA fallback routing.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing approved IC domains.",
  "frontend/public/ic-assets.json": "IC asset configuration allowing .well-known files to be served.",
  "frontend/scripts/audit-screenshot-assets.mjs": "Node script scanning assets and source files to report referenced vs unreferenced screenshot-like images.",
  "frontend/scripts/verify-well-known.mjs": "Node script validating .well-known, domain files, redirects, and ic-assets.json configuration.",
  "frontend/src/.well-known/ic-domains": "Duplicate IC domain verification file stored within src.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes wrapped in the shared SiteLayout.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component using react-hook-form with validation, a topic selector, and simulated async submission.",
  "frontend/src/components/home/BrandsBanner.tsx": "Displays a banner section listing brand logos with simple styling and hover effects.",
  "frontend/src/components/home/HeroCarousel.tsx": "An image carousel with autoplay, drag support, reduced‑motion handling, and slide navigation logic.",
  "frontend/src/components/home/OurExpertiesBanner.tsx": "Renders an industry expertise grid with icons, each revealed on scroll via an animation wrapper.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing branding, navigation links, contact note, and a copyright line.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with brand logo, desktop and mobile navigation, and state-managed mobile menu sheet.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and an outlet for routed content.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "IntersectionObserver-based wrapper that animates children into view unless reduced‑motion is preferred.",
  "frontend/src/components/services/ServiceCard.tsx": "Clickable service card showing icon, title, description, and a call-to-action, keyboard accessible.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Dialog panel showing detailed service info including overview, features, applications, and a contact link.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Search and category filter bar for services using Input and Select components.",
  "frontend/src/config/branding.ts": "Centralized branding config defining logos, meta assets, and company info.",
  "frontend/src/content/services.ts": "Defines the Service type and a list of service entries with metadata and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login flow, identity persistence, and state helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file kept for compatibility with no active backend queries.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook detecting the user's prefers-reduced-motion setting.",
  "frontend/src/hooks/useSeo.ts": "Hook that updates document title and SEO-related meta tags.",
  "frontend/src/ic-assets.json": "Empty asset manifest placeholder.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, themes, utilities, and slideshow styles.",
  "frontend/src/main.static.tsx": "Static build entry that initializes React with a QueryClient and renders App.",
  "frontend/src/main.tsx": "Main entry enabling Internet Identity and react-query before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, company overview text, and a list of automation capabilities using animated scroll reveals.",
  "frontend/src/pages/ContactPage.tsx": "Implements the Contact page with SEO settings, contact details, a Google Maps embed, and a form wrapped in scroll animations.",
  "frontend/src/pages/HomePage.tsx": "Defines the Home page with SEO, animated hero text, calls to action, a carousel, and promotional banners for services and brands.",
  "frontend/src/pages/SolutionsPage.tsx": "Builds the Solutions page with filters, searchable service cards, and a detail panel, applying SEO metadata and scroll animations.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, themes, fonts, animations, and enabling typography and container query plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related tooling with ESNext modules, bundler resolution, and composite project setup.",
  "frontend/vite.config.ts": "Vite config enabling React, a custom verification plugin, alias setup, and build/server settings.",
  "project_state.json": "JSON describing current project state, known issues, and pending feature requests including Industry 4.0 card and renaming a heading."
}