{
  "backend/main.mo": "Defines access-controlled actor handling contact form submissions and user profile CRUD with admin and user permission checks.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS base/theme variables including light/dark color palettes and global styling.",
  "frontend/index.html": "HTML entry file with branding, meta tags, and script entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for main pages wrapped in SiteLayout.",
  "frontend/src/components/contact/ContactForm.tsx": "React Hook Form-based contact form with validation, topic selection, and backend submission.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer layout showing branding, quick links, contact text, and copyright.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with branding, desktop nav, and mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper rendering header, footer, and routed content.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Intersection Observer animation wrapper that reveals content on scroll with reduced‑motion support.",
  "frontend/src/components/services/ServiceCard.tsx": "Renders a clickable service card with icon, title, description, and keyboard accessibility.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Displays a modal panel with detailed service info including features, applications, and a contact button.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Provides search and category filter controls for services using an input and select dropdown.",
  "frontend/src/config/branding.ts": "Defines centralized branding assets including logos, icons, and company metadata.",
  "frontend/src/content/services.ts": "Exports the Service type and a list of service definitions with descriptions, features, applications, and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook for submitting contact forms via the backend actor.",
  "frontend/src/hooks/useReducedMotion.ts": "Tracks the user’s reduced-motion preference via a media query.",
  "frontend/src/hooks/useSeo.ts": "Updates document and social metadata tags based on provided title and description.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, dark mode, accessibility styles, and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, company overview, and a list of automation capabilities using animated scroll reveals.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, SEO metadata, and a contact form with scroll-based animations.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, service previews, and calls-to-action, using SEO setup and scroll reveal effects.",
  "frontend/src/pages/SolutionsPage.tsx": "Provides a filterable list of automation services with search, category filtering, and a detail panel, along with SEO setup.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters and session-stored values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, color variables, fonts, animations, and plugin setup.",
  "project_state.json": "Metadata describing the scaffolded Internet Computer app, including frontend/back-end architecture notes, generated assets, existing feature inventory, and known logo-related issues. It serves as a project state snapshot for build and fix planning."
}