{
  "backend/main.mo": "Motoko actor managing user profiles with access control checks for viewing and saving profiles.",
  "feature_evidence.json": "Feature evidence record describing a UI update to two logo images in the BrandsBanner component.",
  "frontend-file-summaries.txt": "List of concise summaries for all frontend source files.",
  "frontend/docs/FILE_TREE.md": "Documentation stub outlining the project’s file structure.",
  "frontend/docs/screenshot-assets-audit.md": "Documentation explaining the screenshot asset audit tool and its detection rules.",
  "frontend/index.css": "Global Tailwind CSS layer defining theme variables and base styles.",
  "frontend/index.html": "Main HTML entry file setting metadata, favicons, and loading the React app.",
  "frontend/public/_redirects": "Netlify-style redirects enabling .well-known access and SPA fallback.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing allowed IC domains.",
  "frontend/public/ic-assets.json": "IC asset config enabling .well-known directory matching.",
  "frontend/scripts/audit-screenshot-assets.mjs": "Node script that scans for screenshot-like images and checks if they are referenced.",
  "frontend/scripts/verify-well-known.mjs": "Node script verifying domain files, redirect rules, and ic-assets.json validity.",
  "frontend/src/.well-known/ic-domains": "Source copy of IC domain verification entries.",
  "frontend/src/App.tsx": "App entry configuring TanStack Router with routes wrapped in a site layout.",
  "frontend/src/components/contact/ContactForm.tsx": "React form component using react-hook-form to collect contact details, validate inputs, and simulate submission.",
  "frontend/src/components/home/BrandsBanner.tsx": "Displays a banner section with a list of brand logos in a responsive grid.",
  "frontend/src/components/home/HeroCarousel.tsx": "Implements an autoplaying, draggable image carousel with reduced-motion support.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, navigation links, contact info, and copyright.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with branding, navigation links, and a mobile drawer menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including header, footer, and routed content outlet.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Wrapper component that reveals its children with a scroll-triggered animation.",
  "frontend/src/components/services/ServiceCard.tsx": "Card component displaying a service’s icon, title, description, and CTA.",
  "frontend/src/components/services/ServiceDetailPanel.tsx": "Dialog panel showing detailed service info, features, applications, and a contact link.",
  "frontend/src/components/services/ServicesFilterBar.tsx": "Provides search and category filter controls for the services list.",
  "frontend/src/config/branding.ts": "Centralized branding configuration containing logo paths and company metadata.",
  "frontend/src/content/services.ts": "Defines a Service interface and a list of detailed service configurations including descriptions, features, applications, and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, recreating it on identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing login, logout, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Empty compatibility file indicating all backend query hooks were removed for static builds.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook that tracks the user's reduced‑motion preference via matchMedia.",
  "frontend/src/hooks/useSeo.ts": "Hook that updates document title and meta tags for SEO and social previews.",
  "frontend/src/ic-assets.json": "Empty JSON asset file placeholder.",
  "frontend/src/index.css": "Tailwind CSS setup defining design tokens, themes, utilities, and component styles including slideshow and accent colors.",
  "frontend/src/main.static.tsx": "Entry point for static builds rendering App with a configured React Query client.",
  "frontend/src/main.tsx": "Main application entry that wraps App with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/AboutPage.tsx": "React page displaying company information, expertise, and SEO metadata with animated reveal components.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with SEO settings, company contact details, a map embed, and a contact form with scroll animations.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with SEO, a typing‑effect hero section, a carousel, brand banner, and service overview sections.",
  "frontend/src/pages/SolutionsPage.tsx": "Displays filterable automation solutions with search, category filtering, and a detail panel using scroll animations and SEO setup.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, syncing them with sessionStorage, and managing hash‑based query values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, container settings, animations, and plugin integrations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑side tooling using ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, path aliasing, a build‑time verification plugin, chunk splitting, and dev server settings.",
  "project_state.json": "Tracks project metadata, feature requests, known issues, and the current state related to replacing banner logo images."
}