{
  "kind": "build_request",
  "title": "Rename selected heading text to “About Us” and add Industry 4.0 to Solutions page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the text content of the selected element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/section[1]/div[1]/div[1]/div[1]/h1[1]/span[1] to exactly: \"About Us\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "Also rename this selected element as \"About Us\"",
          "rename it to \"About Us\" and also add the same element Industry 4.0 in Our solutions to Solution Page at Last"
        ]
      },
      "acceptanceCriteria": [
        "The selected heading span renders the exact text \"About Us\" (case and spacing match).",
        "No other headings or page text are changed as part of this rename."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an \"Industry 4.0\" solution card to the Solutions page, using the same design/layout as existing Solution cards and using the same title/description/icon/content as the Home page \"Our Solutions\" Industry 4.0 element; ensure it appears at the end of the Solutions grid when viewing /solutions with default filters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4",
          "msg-6",
          "msg-8",
          "msg-13"
        ],
        "quotes": [
          "you did not add Industry 4.0 Card in Solutions Page",
          "ollow the same design/layout as your existing Solution card",
          "just at end",
          "same as in home page our Solutions",
          "rename it to \"About Us\" and also add the same element Industry 4.0 in Our solutions to Solution Page at Last"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /solutions shows an \"Industry 4.0\" card in the solutions grid.",
        "The Industry 4.0 card uses the same card component styling and interactions as the other Solution cards on the Solutions page.",
        "The Industry 4.0 card content (title/description/detailed content/feature list/applications/category/icon) matches the Industry 4.0 item used on the Home page \"Our Solutions\" section.",
        "With default filters (search empty, category = all), the Industry 4.0 card appears as the last item in the grid."
      ]
    }
  ],
  "constraints": [
    "Apply the rename ONLY to the selected element specified by the provided XPath.",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Backend must remain single-actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add new authentication methods or third-party integrations.",
    "Do not redesign the Solutions page layout beyond adding the missing Industry 4.0 card."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}